### Success [Jenkins Build](https://k8s.core-services.aws.idt.net/terra-jenkins/job/terra-live/job/zoho-crm-terra-live/job/PR-5/1/): 
[Info] Plan for apply:
# qa
### Unprocessed Modules List:
#### ? api-gateway-post depends on modified api-gateway
### It is recommended to build dependencies in separate Pull Request
## Changes
```diff
+ create
+ resource "aws_sqs_queue" "dead_letter_queue" {
+ resource "aws_sqs_queue" "this" {
# aws_sqs_queue.dead_letter_queue will be created
# aws_sqs_queue.this will be created

```
<details>
  <summary>SHOW DETAILED PLAN</summary>
  <pre>
  ? api-gateway-post depends on modified api-gateway
This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.
Warning: Value for undeclared variable
The root module does not declare a variable named "global_tags" but a value
was found in file
"/home/jenkins/agent/workspace/ra-live_zoho-crm-terra-live_PR-5/aws/qa/global.tfvars".
To use this value, add a "variable" block to the configuration.
Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.
Warning: Value for undeclared variable
The root module does not declare a variable named "common_tags" but a value
was found in file
"/home/jenkins/agent/workspace/ra-live_zoho-crm-terra-live_PR-5/aws/qa/convert-lead-lambda/terraform.tfvars".
To use this value, add a "variable" block to the configuration.
Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.
Warning: Value for undeclared variable
The root module does not declare a variable named "runtime" but a value was
found in file
"/home/jenkins/agent/workspace/ra-live_zoho-crm-terra-live_PR-5/aws/qa/convert-lead-lambda/terraform.tfvars".
To use this value, add a "variable" block to the configuration.
Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.
Warning: Values for undeclared variables
In addition to the other similar warnings shown, 6 other variable(s) defined
without being declared.
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.
data.aws_caller_identity.current: Refreshing state...
module.datasources.data.aws_caller_identity.current: Refreshing state...
aws_api_gateway_rest_api.this: Refreshing state... [id=b6t492zfc6]
module.datasources.data.terraform_remote_state.iam: Refreshing state...
module.datasources.data.terraform_remote_state.codedeploy: Refreshing state...
module.datasources.data.terraform_remote_state.route53: Refreshing state...
module.datasources.data.terraform_remote_state.vpc: Refreshing state...
module.datasources.data.aws_s3_bucket_objects.core_states: Refreshing state...
module.datasources.data.aws_s3_bucket_objects.infra_states: Refreshing state...
To perform exactly these actions, run the following command to apply:
    terraform apply "api-gateway.out"
module.datasources.data.aws_s3_bucket_objects.infra_states: Refreshing state...
module.datasources.data.aws_s3_bucket_objects.core_states: Refreshing state...
module.datasources.data.aws_s3_bucket_objects.infra_states: Refreshing state...
module.datasources.data.aws_s3_bucket_objects.core_states: Refreshing state...
data.aws_caller_identity.current: Refreshing state...
module.datasources.data.aws_caller_identity.current: Refreshing state...
module.datasources.data.aws_caller_identity.current: Refreshing state...
data.aws_caller_identity.current: Refreshing state...
data.aws_iam_policy_document.this: Refreshing state...
aws_sns_topic.this: Refreshing state... [id=arn:aws:sns:us-east-1:470427355418:zoho-crm-qa-zoho-crm-convert-lead]
data.aws_iam_policy_document.sqs_topic_policy: Refreshing state...
module.datasources.data.terraform_remote_state.codedeploy: Refreshing state...
module.datasources.data.terraform_remote_state.vpc: Refreshing state...
module.datasources.data.terraform_remote_state.vpc: Refreshing state...
module.datasources.data.terraform_remote_state.route53: Refreshing state...
module.datasources.data.terraform_remote_state.route53: Refreshing state...
module.datasources.data.terraform_remote_state.iam: Refreshing state...
module.datasources.data.terraform_remote_state.codedeploy: Refreshing state...
module.datasources.data.terraform_remote_state.iam: Refreshing state...
This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
Terraform will perform the following actions:
  # aws_sqs_queue.dead_letter_queue will be created
  + resource "aws_sqs_queue" "dead_letter_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "zoho-crm-qa-zoho-crm-convert-lead-DLQ"
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + tags                              = {
          + "Name"                      = "zoho-crm-qa-zoho-crm-convert-lead-DLQ"
          + "devops:terraform"          = "Managed by Terraform"
          + "idt:applications_group"    = "not provided"
          + "idt:asset_name"            = "zoho-crm"
          + "idt:environment_type"      = "qa"
          + "idt:github_team_id"        = "not provided"
          + "idt:jira_project_id"       = "not provided"
          + "idt:lob"                   = "tech_dev_br_general"
          + "idt:opsgenie_service_name" = "not provided"
          + "idt:resource_owner_email"  = "not provided"
          + "idt:team_name"             = "zoho-crm"
          + "idt:team_slack_channel"    = "not provided"
        }
      + visibility_timeout_seconds        = 43200
    }
  # aws_sqs_queue.this will be created
  + resource "aws_sqs_queue" "this" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "zoho-crm-qa-zoho-crm-convert-lead"
      + policy                            = jsonencode(
            {
              + Id        = "__default_policy_ID"
              + Statement = [
                  + {
                      + Action    = "sqs:SendMessage"
                      + Condition = {
                          + ArnEquals = {
                              + AWS:SourceArn = "arn:aws:sns:us-east-1:470427355418:zoho-crm-qa-zoho-crm-convert-lead"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "arn:aws:sqs:us-east-1:470427355418:zoho-crm-qa-zoho-crm-convert-lead"
                      + Sid       = "SendMessageCustomPolicy"
                    },
                  + {
                      + Action    = "sqs:SendMessage"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "470427355418"
                        }
                      + Resource  = "arn:aws:sqs:us-east-1:470427355418:zoho-crm-qa-zoho-crm-convert-lead"
                      + Sid       = "SendMessageDefaultPolicy"
                    },
                  + {
                      + Action    = [
                          + "sqs:ReceiveMessage",
                          + "sqs:GetQueueAttributes",
                          + "sqs:DeleteMessage",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "470427355418"
                        }
                      + Resource  = "arn:aws:sns:us-east-1:470427355418:zoho-crm-qa-zoho-crm-convert-lead"
                      + Sid       = "ReceiveMessageDefaultPolicy"
                    },
                  + {
                      + Action    = [
                          + "sqs:ReceiveMessage",
                          + "sqs:GetQueueAttributes",
                          + "sqs:DeleteMessage",
                        ]
                      + Condition = {
                          + ArnEquals = {
                              + AWS:SourceArn = "arn:aws:iam::470427355418:role/AWSReservedSSO_SNS_SQS_Full_access_8c23d4369c63116e"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "arn:aws:sns:us-east-1:470427355418:zoho-crm-qa-zoho-crm-convert-lead"
                      + Sid       = "ReceiveMessageCustomPolicy"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + receive_wait_time_seconds         = 0
      + redrive_policy                    = (known after apply)
      + tags                              = {
          + "Name"                      = "zoho-crm-qa-zoho-crm-convert-lead"
          + "devops:terraform"          = "Managed by Terraform"
          + "idt:applications_group"    = "not provided"
          + "idt:asset_name"            = "zoho-crm"
          + "idt:environment_type"      = "qa"
          + "idt:github_team_id"        = "not provided"
          + "idt:jira_project_id"       = "not provided"
          + "idt:lob"                   = "tech_dev_br_general"
          + "idt:opsgenie_service_name" = "not provided"
          + "idt:resource_owner_email"  = "not provided"
          + "idt:team_name"             = "zoho-crm"
          + "idt:team_slack_channel"    = "not provided"
        }
      + visibility_timeout_seconds        = 30
    }
Plan: 2 to add, 0 to change, 0 to destroy.
  </pre>
</details>